# PANDAS PRACTICE ON sales_data_sample.csv FROM KAGGLE (2800+ records)

In [5]:
import pandas as pd
df= pd.read_csv(r"sales_data_sample.csv" , encoding='ISO-8859-1')

# Select only the columns: Order no, quantity ordered, price of each

In [19]:
df[['ORDERNUMBER','QUANTITYORDERED','PRICEEACH']]

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH
0           10107               30      95.70
1           10121               34      81.35
2           10134               41      94.74
3           10145               45      83.26
4           10159               49     100.00
...           ...              ...        ...
2818        10350               20     100.00
2819        10373               29     100.00
2820        10386               43     100.00
2821        10397               34      62.24
2822        10414               47      65.52

[2823 rows x 3 columns]

# Create a new column called TOTAL_SALES which is the quantity multiplied by price (QUANTITYORDERED * PRICEEACH).

In [24]:
df.columns

Index(['ORDERNUMBER', 'QUANTITYORDERED', 'PRICEEACH', 'ORDERLINENUMBER',
       'SALES', 'ORDERDATE', 'STATUS', 'QTR_ID', 'MONTH_ID', 'YEAR_ID',
       'PRODUCTLINE', 'MSRP', 'PRODUCTCODE', 'CUSTOMERNAME', 'PHONE',
       'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE',
       'COUNTRY', 'TERRITORY', 'CONTACTLASTNAME', 'CONTACTFIRSTNAME',
       'DEALSIZE'],
      dtype='object')

In [26]:
df['TOTAL_SALES']= df['QUANTITYORDERED']* df['PRICEEACH']

In [28]:
df.columns

Index(['ORDERNUMBER', 'QUANTITYORDERED', 'PRICEEACH', 'ORDERLINENUMBER',
       'SALES', 'ORDERDATE', 'STATUS', 'QTR_ID', 'MONTH_ID', 'YEAR_ID',
       'PRODUCTLINE', 'MSRP', 'PRODUCTCODE', 'CUSTOMERNAME', 'PHONE',
       'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE',
       'COUNTRY', 'TERRITORY', 'CONTACTLASTNAME', 'CONTACTFIRSTNAME',
       'DEALSIZE', 'TOTAL_SALES'],
      dtype='object')

# Find the total sales per order (ORDERNUMBER).

In [31]:
df.groupby('ORDERNUMBER')['TOTAL_SALES'].sum()

ORDERNUMBER
10100     9982.25
10101     8976.96
10102     5955.74
10103    47886.21
10104    35084.80
           ...
10421     5328.00
10422     6166.80
10423     8411.95
10424    23280.98
10425    35554.31
Name: TOTAL_SALES, Length: 307, dtype: float64

# Find the top 5 orders with the highest total sales.

In [40]:
df.sort_values('TOTAL_SALES', ascending= False).head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE,TOTAL_SALES
418,10405,97,93.28,5,9048.16,4/14/2005 0:00,Shipped,2,4,2005,...,NaN,Strasbourg,NaN,67000,France,EMEA,Citeaux,Frederique,Large,9048.16
1995,10405,76,100.00,3,11739.70,4/14/2005 0:00,Shipped,2,4,2005,...,NaN,Strasbourg,NaN,67000,France,EMEA,Citeaux,Frederique,Large,7600.00
598,10407,76,100.00,2,14082.80,4/22/2005 0:00,On Hold,2,4,2005,...,NaN,San Jose,CA,94217,USA,NaN,Frick,Sue,Large,7600.00
2586,10401,85,88.75,10,7543.75,4/3/2005 0:00,On Hold,2,4,2005,...,NaN,Newark,NJ,94019,USA,NaN,Brown,William,Large,7543.75
1714,10407,76,94.50,6,7182.00,4/22/2005 0:00,On Hold,2,4,2005,...,NaN,San Jose,CA,94217,USA,NaN,Frick,Sue,Large,7182.00

# Find the total sales per product line (PRODUCTLINE).

In [46]:
df.groupby('PRODUCTLINE')['SALES'].sum().sort_values(ascending=False)

PRODUCTLINE
Classic Cars        3919615.66
Vintage Cars        1903150.84
Motorcycles         1166388.34
Trucks and Buses    1127789.84
Planes               975003.57
Ships                714437.13
Trains               226243.47
Name: SALES, dtype: float64

# Find the average sale amount (SALES) per country.

In [49]:
df.columns

Index(['ORDERNUMBER', 'QUANTITYORDERED', 'PRICEEACH', 'ORDERLINENUMBER',
       'SALES', 'ORDERDATE', 'STATUS', 'QTR_ID', 'MONTH_ID', 'YEAR_ID',
       'PRODUCTLINE', 'MSRP', 'PRODUCTCODE', 'CUSTOMERNAME', 'PHONE',
       'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE',
       'COUNTRY', 'TERRITORY', 'CONTACTLASTNAME', 'CONTACTFIRSTNAME',
       'DEALSIZE', 'TOTAL_SALES'],
      dtype='object')

In [63]:
df.groupby('COUNTRY')['SALES'].mean().head()

COUNTRY
Australia    3408.773514
Austria      3673.864182
Belgium      3285.230909
Canada       3201.122286
Denmark      3899.002381
Name: SALES, dtype: float64

# Find all orders where TOTAL_SALES is greater than 5000.

In [77]:
df[df['TOTAL_SALES']>5000].head(2)

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE,TOTAL_SALES
25,10417,66,100.0,2,7516.08,5/13/2005 0:00,Disputed,2,5,2005,...,NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Large,6600.0
104,10403,66,100.0,9,11886.60,4/8/2005 0:00,Shipped,2,4,2005,...,NaN,Liverpool,NaN,WX1 6LT,UK,EMEA,Devon,Elizabeth,Large,6600.0

# Create a new column called SALES_CATEGORY:

"High" if TOTAL_SALES > 3000

"Medium" if TOTAL_SALES between 1000 and 3000

"Low" if TOTAL_SALES < 1000

In [80]:
import numpy as np

df['SALES_CATEGORY'] = np.where(df['TOTAL_SALES'] > 3000, 'High',
                        np.where(df['TOTAL_SALES'] >= 1000, 'Medium', 'Low'))

df[['TOTAL_SALES','SALES_CATEGORY']].head(10)

   TOTAL_SALES SALES_CATEGORY
0      2871.00         Medium
1      2765.90         Medium
2      3884.34           High
3      3746.70           High
4      4900.00           High
5      3479.76           High
6      2497.77         Medium
7      4800.00           High
8      2168.54         Medium
9      4100.00           High